export const CATEGORIES = [
    {
        "title": "Minecraft",
        "slug": "minecraft",
        "description": "Погрузитесь в бескрайний мир творчества и приключений в Minecraft! Эта категория посвящена самой популярной песочнице, где вы можете строить, исследовать и выживать в уникальных мирах. Следите за стримами, вдохновляйтесь креативными постройками, участвуйте в совместных проектах и делитесь своими достижениями. Присоединяйтесь к сообществу, где фантазия не знает границ, и откройте для себя безумные возможности, которые предлагает Minecraft!",
        "previewUrl": "/categories/minecraft.webp"
    },
    {
        "title": "Fortnite",
        "slug": "fortnite",
        "description": "Исследуйте мир Fortnite, где каждый матч превращается в настоящую битву за выживание! Эта категория посвящена самому популярному королевскому бою, в котором элементы строительства и стратегии переплетаются с динамичными боями. Следите за стримами, улучшайте свои навыки и участвуйте в турнирах! Присоединяйтесь к миллионам игроков по всему миру, чтобы испытать невероятные приключения.",
        "previewUrl": "/categories/fortnite.webp"
    },
    {
        "title": "Valorant",
        "slug": "valorant",
        "description": "Valorant — это тактический шутер, который ставит на первое место командную игру и стратегию. Присоединяйтесь к сообществу профессионалов, следите за матчами и учитесь от лучших игроков! Развивайте свои тактические навыки, чтобы стать мастером игры и достичь новых высот.",
        "previewUrl": "/categories/valorant.webp"
    },
    {
        "title": "League of Legends",
        "slug": "league-of-legends",
        "description": "Откройте для себя мир League of Legends, самого популярного MOBA в мире. Командные стратегии, динамичные бои и множество уникальных чемпионов ждут вас в этом эпическом сражении! Станьте частью глобального сообщества игроков и покажите свою командную игру на крупнейших турнирах.",
        "previewUrl": "/categories/league-of-legends.webp"
    },
    {
        "title": "Call of Duty",
        "slug": "call-of-duty",
        "description": "Call of Duty — это серия шутеров с захватывающими сюжетами и многопользовательскими боями. Погрузитесь в войну, следите за новыми релизами и турнирами, развивайте свои навыки! Присоединяйтесь к действию и участвуйте в самых ярких сражениях.",
        "previewUrl": "/categories/call-of-duty.webp"
    },
    {
        "title": "Apex Legends",
        "slug": "apex-legends",
        "description": "Apex Legends — это королевский бой с уникальными героями, каждый из которых имеет свои способности и стиль игры. Побеждайте в команде и достигайте победы в напряжённых матчах! Вдохновляйтесь тактиками лучших игроков и становитесь лидером в борьбе за выживание.",
        "previewUrl": "/categories/apex-legends.webp"
    },
    {
        "title": "Dota 2",
        "slug": "dota-2",
        "description": "Dota 2 — это настоящая классика среди MOBA. Присоединяйтесь к этим стратегическим сражениям и следите за крупнейшими турнирами, где лучшие игроки мира показывают свои навыки! Овладейте искусством командной работы и станьте мастером игры.",
        "previewUrl": "/categories/dota-2.webp"
    },
    {
        "title": "PUBG",
        "slug": "pubg",
        "description": "PUBG — это игра в жанре battle royale, где каждый выстрел может стать решающим. Присоединяйтесь к эпическим сражениям и пробивайтесь к победе! Вдохновляйтесь тактиками и стратегиями других игроков, чтобы добиться успеха в этой напряжённой игре.",
        "previewUrl": "/categories/pubg.webp"
    },
    {
        "title": "Rainbow Six Siege",
        "slug": "rainbow-six-siege",
        "description": "Rainbow Six Siege — это тактический шутер, где важна каждая деталь. Используйте умные стратегии, командную работу и уникальные способности персонажей для достижения победы. Развивайте свои навыки и становитесь частью профессиональной сцены игры.",
        "previewUrl": "/categories/rainbow-six-siege.webp"
    },
    {
        "title": "Counter-Strike",
        "slug": "counter-strike",
        "description": "Counter-Strike — это легендарный командный шутер, который создал стандарты для жанра. Присоединяйтесь к динамичным матчам, улучшайте свои навыки и станьте мастером стрельбы! Присутствуйте на крупнейших турнирах и погружайтесь в мир высококлассных сражений.",
        "previewUrl": "/categories/counter-strike.webp"
    },
    {
        "title": "Hearthstone",
        "slug": "hearthstone",
        "description": "Hearthstone — это коллекционная карточная игра от Blizzard, где каждый ход может стать решающим. Стройте свою колоду и сражайтесь с игроками по всему миру! Присоединяйтесь к сообществу поклонников и участвуй в турнирах по карточным стратегиям.",
        "previewUrl": "/categories/hearthstone.webp"
    },
    {
        "title": "Overwatch",
        "slug": "overwatch",
        "description": "Overwatch — это командный шутер с героями, каждый из которых обладает уникальными способностями. Следите за матчами и улучшайте свои навыки в игре! Станьте частью захватывающих командных боёв и добивайтесь победы с помощью тактики и слаженности.",
        "previewUrl": "/categories/overwatch.webp"
    },
    {
        "title": "The Witcher 3",
        "slug": "the-witcher-3",
        "description": "Погрузитесь в атмосферу фэнтезийного мира The Witcher 3: Wild Hunt. Исследуйте огромные просторы, сражайтесь с чудовищами и проходите увлекательные квесты. Присоединяйтесь к истории ведьмака Геральта и становитесь мастером боевых искусств.",
        "previewUrl": "/categories/the-witcher-3.webp"
    },
    {
        "title": "Cyberpunk 2077",
        "slug": "cyberpunk-2077",
        "description": "Cyberpunk 2077 — это захватывающий мир в стиле киберпанк, где каждый выбор имеет значение. Откройте для себя мир Найт-Сити, полный опасностей и возможностей. Вливайте свою судьбу в этот мир и принимайте участие в важных решениях.",
        "previewUrl": "/categories/cyberpunk-2077.webp"
    },
    {
        "title": "GTA V",
        "slug": "gta-v",
        "description": "GTA V — это мир преступности, свободы и приключений. Ведите машину, совершайте ограбления и наслаждайтесь захватывающими моментами в открытом мире Лос-Сантоса. Присоединяйтесь к приключениям и становитесь частью эпичной истории.",
        "previewUrl": "/categories/gta-v.webp"
    },
    {
        "title": "Elden Ring",
        "slug": "elden-ring",
        "description": "Elden Ring — это эпическая игра в жанре action RPG, созданная от разработчиков Dark Souls. Погрузитесь в опасный и красивый мир, где каждое сражение может стать последним. Откройте для себя мир, полный чудовищ, магии и старинных тайн.",
        "previewUrl": "/categories/elden-ring.webp"
    },
    {
        "title": "Just Chatting",
        "slug": "just-chatting",
        "description": "Just Chatting — категория для всех, кто любит общаться и делиться своими мыслями с аудиторией. Подключайтесь к стримам, где можно поговорить на любые темы! Общайтесь с другими зрителями и создавайте уникальные беседы.",
        "previewUrl": "/categories/just-chatting.webp"
    },
    {
        "title": "FIFA",
        "slug": "fifa",
        "description": "FIFA — это культовая футбольная серия, которая погружает вас в атмосферу настоящих матчей и турниров. Создайте свою команду, играйте за звёзд и станьте чемпионом мира! Станьте частью футбольной страсти и гонитесь за титулами.",
        "previewUrl": "/categories/fifa.webp"
    },
    {
        "title": "The Elder Scrolls V: Skyrim",
        "slug": "skyrim",
        "description": "Skyrim — это захватывающий фэнтезийный мир, полный магии, приключений и древних тайн. Пройдите через эпическое путешествие и спасите мир от разрушения! Погружайтесь в атмосферу древних земель и откройте новые горизонты для своих героев.",
        "previewUrl": "/categories/skyrim.webp"
    },
    {
        "title": "Red Dead Redemption 2",
        "slug": "red-dead-redemption-2",
        "description": "Red Dead Redemption 2 — это вестерн с открытым миром, который предлагает захватывающие приключения на Диком Западе. Стройте свою судьбу и переживайте историю о братстве и предательстве. Присоединяйтесь к команде и разгадывайте тайны старого Запада.",
        "previewUrl": "/categories/red-dead-redemption-2.webp"
    }
]
