const MESSAGES = {
    welcome: `
      👋 <strong>Добро пожаловать в наше приложение!</strong>
  
      Мы рады, что вы с нами. Чтобы начать получать уведомления, вам нужно связать ваш аккаунт.
  
      Для этого перейдите в раздел <strong>"Уведомления"</strong>, чтобы завершить настройку. Как только это будет сделано, уведомления начнут поступать вам прямо в Telegram!
  
      <em>Чтобы продолжить, нажмите на кнопку ниже и перейдите на сайт для завершения настройки.</em>
    `,
    authSuccess: "✅ <strong>Аутентификация успешна!</strong> Ваш аккаунт теперь связан с платформой, и вы готовы получать уведомления.",
    invalidToken: "⚠️ <strong>Ошибка:</strong> Недействительный или просроченный токен. Пожалуйста, попробуйте снова.",
};

export default MESSAGES;
